In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['a','b','c']
data = [10,20,30]
arr = np.array(data)
pd.Series(data=data, index= labels)

a    10
b    20
c    30
dtype: int64

In [3]:
df = pd.DataFrame(np.random.randn(5,4),['a','b','c','d','e'],['w','x','y','z'])
df

          w         x         y         z
a  0.526422  0.295647  0.369720  1.134545
b  1.182705 -0.684063  1.459926  0.315922
c  1.672057  0.266900 -0.269547 -1.745553
d -0.180315  1.382944  0.886120 -0.445924
e  0.263732 -0.951620  0.280855 -0.413763

In [4]:
df['w']

a    0.526422
b    1.182705
c    1.672057
d   -0.180315
e    0.263732
Name: w, dtype: float64

In [5]:
df.w

a    0.526422
b    1.182705
c    1.672057
d   -0.180315
e    0.263732
Name: w, dtype: float64

In [6]:
df[['w','z']]

          w         z
a  0.526422  1.134545
b  1.182705  0.315922
c  1.672057 -1.745553
d -0.180315 -0.445924
e  0.263732 -0.413763

In [7]:
df['new'] = df['w'] + df['y']
df

          w         x         y         z       new
a  0.526422  0.295647  0.369720  1.134545  0.896142
b  1.182705 -0.684063  1.459926  0.315922  2.642631
c  1.672057  0.266900 -0.269547 -1.745553  1.402510
d -0.180315  1.382944  0.886120 -0.445924  0.705805
e  0.263732 -0.951620  0.280855 -0.413763  0.544588

In [8]:
df.drop('new', axis=1)

          w         x         y         z
a  0.526422  0.295647  0.369720  1.134545
b  1.182705 -0.684063  1.459926  0.315922
c  1.672057  0.266900 -0.269547 -1.745553
d -0.180315  1.382944  0.886120 -0.445924
e  0.263732 -0.951620  0.280855 -0.413763

In [9]:
df.drop('e', axis= 0)

          w         x         y         z       new
a  0.526422  0.295647  0.369720  1.134545  0.896142
b  1.182705 -0.684063  1.459926  0.315922  2.642631
c  1.672057  0.266900 -0.269547 -1.745553  1.402510
d -0.180315  1.382944  0.886120 -0.445924  0.705805

In [10]:
print(df.loc['a'])
print(df.iloc[0])

w      0.526422
x      0.295647
y      0.369720
z      1.134545
new    0.896142
Name: a, dtype: float64
w      0.526422
x      0.295647
y      0.369720
z      1.134545
new    0.896142
Name: a, dtype: float64

In [11]:
df[['w']]

          w
a  0.526422
b  1.182705
c  1.672057
d -0.180315
e  0.263732

In [12]:
df.loc[['a','b'],['w','y']]

          w         y
a  0.526422  0.369720
b  1.182705  1.459926

In [16]:
bool_df = df>0
print(bool_df)

       w      x      y      z   new
a   True   True   True   True  True
b   True  False   True   True  True
c   True   True  False  False  True
d  False   True   True  False  True
e   True  False   True  False  True

In [17]:
df[df>0]

          w         x         y         z       new
a  0.526422  0.295647  0.369720  1.134545  0.896142
b  1.182705       NaN  1.459926  0.315922  2.642631
c  1.672057  0.266900       NaN       NaN  1.402510
d       NaN  1.382944  0.886120       NaN  0.705805
e  0.263732       NaN  0.280855       NaN  0.544588

In [19]:
df['w'] > 0

a     True
b     True
c     True
d    False
e     True
Name: w, dtype: bool

In [20]:
df[df['w']>0]

          w         x         y         z       new
a  0.526422  0.295647  0.369720  1.134545  0.896142
b  1.182705 -0.684063  1.459926  0.315922  2.642631
c  1.672057  0.266900 -0.269547 -1.745553  1.402510
e  0.263732 -0.951620  0.280855 -0.413763  0.544588

In [22]:
df[df['z'] < 0]

          w         x         y         z       new
c  1.672057  0.266900 -0.269547 -1.745553  1.402510
d -0.180315  1.382944  0.886120 -0.445924  0.705805
e  0.263732 -0.951620  0.280855 -0.413763  0.544588

In [24]:
bool_series = df['w'] > 0
bool_dataframe = df[bool_series]
bool_dataframe

          w         x         y         z       new
a  0.526422  0.295647  0.369720  1.134545  0.896142
b  1.182705 -0.684063  1.459926  0.315922  2.642631
c  1.672057  0.266900 -0.269547 -1.745553  1.402510
e  0.263732 -0.951620  0.280855 -0.413763  0.544588

In [26]:
df[(df['w'] < 0) & (df['y'] > 0)] #use ampresent do not use and

          w         x        y         z       new
d -0.180315  1.382944  0.88612 -0.445924  0.705805

In [27]:
df[(df['w'] < 0) | (df['y'] > 0)]

          w         x         y         z       new
a  0.526422  0.295647  0.369720  1.134545  0.896142
b  1.182705 -0.684063  1.459926  0.315922  2.642631
d -0.180315  1.382944  0.886120 -0.445924  0.705805
e  0.263732 -0.951620  0.280855 -0.413763  0.544588

In [32]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [33]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [35]:
heir = pd.DataFrame(np.random.randn(6,2), hier_index, ['A','B'])
heir

             A         B
G1 1  0.370640  0.996846
   2  0.175816 -0.422696
   3  0.176797  1.724012
G2 1  1.226975  0.095466
   2 -1.298950 -0.004204
   3  1.013633 -1.459420

In [40]:
heir.loc['G1'].loc[2]

A    0.175816
B   -0.422696
Name: 2, dtype: float64

In [41]:
heir.loc['G1'].loc[2]['B']

-0.4226956670841267

In [42]:
heir.index.names = ['Groups', 'num']
heir

                   A         B
Groups num
G1     1    0.370640  0.996846
       2    0.175816 -0.422696
       3    0.176797  1.724012
G2     1    1.226975  0.095466
       2   -1.298950 -0.004204
       3    1.013633 -1.459420

In [44]:
heir.xs(1, level='num')

               A         B
Groups
G1      0.370640  0.996846
G2      1.226975  0.095466

In [45]:
data = {'Company':['GOOG', 'GOOG', 'MSFT','MSFT', 'FB', 'FB'],
        'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales': [200,120,340,124,243,350]
        }

In [46]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [47]:
by_company = df.groupby('Company')
by_company

In [48]:
by_company.sum()

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [53]:
by_company.mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [54]:
by_company.median(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [55]:
by_company.median(numeric_only=True).loc['FB']

Sales    296.5
Name: FB, dtype: float64

In [57]:
by_company.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [59]:
df = pd.DataFrame(np.random.randn(4,4))
df2= pd.DataFrame(np.random.randn(4,4))
df

          0         1         2         3
0 -1.772975 -1.341165  1.309883  1.782182
1  1.405701 -2.637771 -0.038367 -0.441954
2  0.743511 -0.790616  0.819329  0.463111
3 -0.336061 -0.049930 -0.740395  1.520304

In [60]:
pd.concat([df,df2])

          0         1         2         3
0 -1.772975 -1.341165  1.309883  1.782182
1  1.405701 -2.637771 -0.038367 -0.441954
2  0.743511 -0.790616  0.819329  0.463111
3 -0.336061 -0.049930 -0.740395  1.520304
0 -1.127864  0.231213 -0.239716  0.538384
1  1.119780 -0.516666  0.597072  0.725319
2  1.295772  1.427085 -0.226721 -0.027770
3  0.666331  1.059486  0.973101  0.722710

In [61]:
pd.concat([df,df2], axis=1)

,0,1,2,3,0,1,2,3
0,-1.772975,-1.341165,1.309883,1.782182,-1.127864,0.231213,-0.239716,0.538384
1,1.405701,-2.637771,-0.038367,-0.441954,1.119780,-0.516666,0.597072,0.725319
2,0.743511,-0.790616,0.819329,0.463111,1.295772,1.427085,-0.226721,-0.027770
3,-0.336061,-0.049930,-0.740395,1.520304,0.666331,1.059486,0.973101,0.722710

In [65]:
data = {'Name':['Tom', 'Brad', 'Kyle', 'Jerry'],
        'Age':[20, 21, 19, 20],
        'Height' : [6.1, 5.9, 6.0, 6.1]
        }
df = pd.DataFrame(data)
df

    Name  Age  Height
0    Tom   20     6.1
1   Brad   21     5.9
2   Kyle   19     6.0
3  Jerry   20     6.1

In [69]:
print(df['Age'].nunique())
print(df['Age'].unique())

3
[20 21 19]

In [70]:
df['Age'].value_counts()

Age
20    2
21    1
19    1
Name: count, dtype: int64

In [71]:
df[(df['Age'] > 19) & (df['Height'] > 6)]

    Name  Age  Height
0    Tom   20     6.1
3  Jerry   20     6.1

In [72]:
def mul(x):
    return x*2
df['Age'].apply(mul)

0    40
1    42
2    38
3    40
Name: Age, dtype: int64

In [73]:
df['Name'].apply(len)

0    3
1    4
2    4
3    5
Name: Name, dtype: int64

In [74]:
df['Height'].apply(lambda x:x*2)

0    12.2
1    11.8
2    12.0
3    12.2
Name: Height, dtype: float64

In [75]:
df.drop('Height', axis=1, inplace=True)

In [76]:
df

    Name  Age
0    Tom   20
1   Brad   21
2   Kyle   19
3  Jerry   20

In [78]:
df.sort_values(by='Name')

    Name  Age
1   Brad   21
3  Jerry   20
2   Kyle   19
0    Tom   20

In [79]:
df.isnull()

    Name    Age
0  False  False
1  False  False
2  False  False
3  False  False

In [81]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [82]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN